artillery/hello.yml
config:
  target: 'http://localhost:3000'
  processor: './randomEndPoints.js'
  http: 
    pool: 14
  phases:
    - duration: 90
      arrivalRate: 400
      rampTo: 1000
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: 'navigate to a particular song'
    flow: 
    - function: 'generateRandomEndPoints'
    - get:
        url: "/song/{{ endPoint }}"
    - post: 
        url: "/song/{{ endPoint }}"
        body: