artillery/post.yml
config:
  target: 'http://localhost:3000'
  processor: './generateData.js'
  http: 
    pool: 14
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 100
      name: "Warm up the application"
    - duration: 60
      arrivalRate: 100
      name: "Substain max load"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: 'navigate to a particular song'
    flow: 
    - function: 'generateRandomEndPoints'
    - post:
      url: "/api/comments/song/29000000/comment"
      json:
        songid: 4
        profilepic: "http://www.sampleurl.com/api/large/2323"
        username: "big d"
        message: "you know you want to get with thie :?"
        songtime: "4:69"
        followers: 43434