artillery/tests.yml
config:
  target: 'http://localhost:3001'
  processor: './generateData.js'
  http: 
    pool: 14
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 400
      name: "Warm up the application"
    - duration: 60
      arrivalRate: 1000
      name: "Substain max load"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: 'navigate to a particular song'
    flow: 
    - function: 'generateRandomEndPoints'
    - get:
        url: "/{{ endPoint }}"
  # - name: 'post a new message'
  #   flow: 
  #   - function: 'generateRandomEndPoints'
  #   - post: 
  #       url: "/{{ endPoint }}"
  #       json: 
  #         songid: 45000000
  #         profilepic: 'https:s3.amazonaws.com/cloud-vibes-comments/large1'
  #         message: 'this is a random message'
  #         postedat: '2019-03-05'
  #         songtime: '3:00'
  #         followers: 232